Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# Settings_HostAddressLoopbackToggleSwitch.AutomationProperties.HelpText
source: Only applicable when wsl2.networkingMode is set to mirrored. When set to True, will allow the Container to connect to the Host, or the Host to connect to the Container, by an IP address that's assigned to the Host. Note that the 127.0.0.1 loopback address can always be used - this option allows for all additionally assigned local IP addresses to be used as well.
cs_cz: Lze použít pouze v případě, že je vlastnost wsl2.networkingMode nastavena na zrcadlený režim. Pokud je nastavená hodnota True, umožní kontejneru připojit se k hostiteli nebo hostiteli připojit se ke kontejneru pomocí IP adresy přiřazené k hostiteli. Upozorňujeme, že adresu zpětné smyčky 127.0.0.1 je možné vždy použít – tato možnost umožňuje použití všech dodatečně přiřazených místních IP adres.
da_dk: Gælder kun, når wsl2.networkingMode er indstillet til spejlet. Når den er indstillet til Sand, kan objektbeholderen oprette forbindelse til værten eller værten for at oprette forbindelse til objektbeholderen af en IP-adresse, der er tildelt værten. Bemærk, at tilbagekoblingsadressen 127.0.0.1 altid kan bruges – denne indstilling gør det muligt også at bruge alle yderligere tildelte lokale IP-adresser.
de_de: Gilt nur, wenn "wsl2.networkingMode" auf "mirrored" festgelegt ist. Bei Festlegung auf TRUE kann der Container über eine ip-Adresse, die dem Host zugewiesen ist, eine Verbindung mit dem Host herstellen oder vom Host eine Verbindung mit dem Container herstellen. Beachten Sie, dass die Loopbackadresse 127.0.0.1 immer verwendet werden kann. Mit dieser Option können auch alle zusätzlich zugewiesenen lokalen IP-Adressen verwendet werden.
el_gr: Ισχύει μόνο όταν το wsl2.networkingMode έχει οριστεί σε mirrored. Όταν οριστεί σε True, θα επιτρέψει στο κοντέινερ να συνδεθεί στον Κεντρικό υπολογιστή ή στον Κεντρικό υπολογιστή να συνδεθεί στο κοντέινερ, μέσω μιας διεύθυνσης IP που έχει εκχωρηθεί στον Κεντρικό υπολογιστή. Σημειώστε ότι η διεύθυνση επαναφοράς 127.0.0.1 μπορεί πάντα να χρησιμοποιηθεί - αυτή η επιλογή επιτρέπει να χρησιμοποιούνται επίσης όλες οι πρόσθετες τοπικές διευθύνσεις IP που έχουν εκχωρηθεί.
es_es: Solo es aplicable cuando wsl2.networkingMode está establecido en reflejado. Cuando se establece en True, permitirá que el contenedor se conecte al host o que el host se conecte al contenedor mediante una dirección IP asignada al host. Tenga en cuenta que siempre se puede usar la dirección de bucle invertido 127.0.0.1. Esta opción también permite usar todas las direcciones IP locales asignadas adicionalmente.
fi_fi: Käytettävissä vain, kun wsl2.networkingMode-asetus on peilattu. Kun asetus on True, säilö voi muodostaa yhteyden isäntään tai isäntään muodostamaan yhteyden säilöön isäntään määritetyllä IP-osoitteella. Huomaa, että 127.0.0.1-silmukkaosoitetta voi aina käyttää – tämä vaihtoehto mahdollistaa myös kaikkien lisäksi määritettyjen paikallisten IP-osoitteiden käyttämisen.
fr_fr: Applicable uniquement quand wsl2.networkingMode a la valeur mirrored. Quand la valeur est True, le conteneur peut se connecter à l’hôte ou à l’hôte pour se connecter au conteneur, par une adresse IP attribuée à l’hôte. Notez que l’adresse de bouclage 127.0.0.1 peut toujours être utilisée . Cette option permet également d’utiliser toutes les adresses IP locales affectées en plus.
hu_hu: Csak akkor alkalmazható, ha a wsl2.networkingMode tükrözött értékre van állítva. Ha Igaz értékre van állítva, a tároló egy, a gazdagéphez rendelt IP-cím használatával csatlakozhat a gazdagéphez, vagy a gazdagép csatlakozhat a tárolóhoz. Vegye figyelembe, hogy a 127.0.0.1 visszacsatolási cím mindig használható – ez a beállítás lehetővé teszi az összes további hozzárendelt helyi IP-cím használatát is.
it_it: Applicabile solo quando wsl2.networkingMode è impostato su mirroring. Se impostato su True, consentirà al contenitore di connettersi all'host o all'host di connettersi al contenitore tramite un indirizzo IP assegnato all'host. Si noti che è sempre possibile usare l'indirizzo di loopback 127.0.0.1. Questa opzione consente anche l'uso di tutti gli indirizzi IP locali assegnati.
ja_jp: wsl2.networkingMode が mirrored に設定されている場合にのみ適用されます。True に設定すると、ホストに割り当てられている IP アドレスによって、コンテナーがホストに接続するか、ホストがコンテナーに接続できるようになります。127.0.0.1 ループバック アドレスは常に使用できることに注意してください。このオプションでは、追加で割り当てられたすべてのローカル IP アドレスも使用できます。
ko_kr: wsl2.networkingMode가 미러로 설정된 경우에만 적용할 수 있습니다. True로 설정하면 호스트에 할당된 IP 주소로 컨테이너가 호스트에 연결하거나 호스트가 컨테이너에 연결할 수 있습니다. 127.0.0.1 루프백 주소는 항상 사용할 수 있습니다. 이 옵션을 사용하면 추가로 할당된 모든 로컬 IP 주소도 사용할 수 있습니다.
nb_no: Gjelder bare når wsl2.networkingMode er satt til avspeilet. Når satt til Sann, tillates beholderen å koble til verten, eller verten for å koble til beholderen, med en IP-adresse som er tilordnet verten. Vær oppmerksom på at 127.0.0.1-tilbakekoblingsadressen alltid kan brukes . Dette alternativet gjør det mulig å bruke alle ekstra tilordnede lokale IP-adresser også.
nl_nl: Alleen van toepassing wanneer wsl2.networkingMode is ingesteld op gespiegeld. Als deze optie is ingesteld op Waar, kan de container verbinding maken met de host of de host om verbinding te maken met de container door een IP-adres dat aan de host is toegewezen. Het loopback-adres 127.0.0.1 kan altijd worden gebruikt. Met deze optie kunnen ook alle extra toegewezen lokale IP-adressen worden gebruikt.
pl_pl: Ma zastosowanie tylko wtedy, gdy właściwość wsl2.networkingMode jest ustawiona na wartość mirrored. Po ustawieniu wartości True kontener będzie mógł łączyć się z hostem lub hostem w celu nawiązania połączenia z kontenerem za pomocą adresu IP przypisanego do hosta. Pamiętaj, że adres sprzężenia zwrotnego 127.0.0.1 może być zawsze używany — ta opcja umożliwia również użycie wszystkich dodatkowo przypisanych lokalnych adresów IP.
pt_br: Apenas aplicável quando wsl2.networkingMode está definido como espelhado. Quando definido como Verdadeiro, permitirá ao Contentor ligar ao Anfitrião ou ao Anfitrião ligar ao Contentor através de um endereço IP atribuído ao Anfitrião. Tenha em atenção que o endereço de loopback 127.0.0.1 pode sempre ser utilizado - esta opção também permite a utilização de todos os endereços IP locais atribuídos adicionalmente.
pt_pt: Apenas aplicável quando wsl2.networkingMode está definido como espelhado. Quando definido como Verdadeiro, permitirá ao Contentor ligar ao Anfitrião ou ao Anfitrião ligar ao Contentor através de um endereço IP atribuído ao Anfitrião. Tenha em atenção que o endereço de loopback 127.0.0.1 pode sempre ser utilizado - esta opção também permite a utilização de todos os endereços IP locais atribuídos adicionalmente.
ru_ru: Применимо только в том случае, если для wsl2.networkingMode установлено зеркальное отображение. Если установлено значение ИСТИНА, контейнеру будет разрешено подключаться к узлу или узлу подключаться к контейнеру по IP-адресу, назначенному узлу. Обратите внимание, что адрес замыкания на себя 127.0.0.1 можно использовать всегда — эта опция позволяет также использовать все дополнительно назначенные локальные IP-адреса.
sv_se: Gäller endast när wsl2.networkingMode är inställt på spegling. När värdet är True tillåter det att containern ansluter till värden, eller värden, för att ansluta till containern, via en IP-adress som tilldelats värden. Observera att loopback-adressen 127.0.0.1 alltid kan användas – med det här alternativet kan även alla ytterligare tilldelade lokala IP-adresser användas.
tr_tr: Sadece wsl2.networkingMode yansıtılmış olarak ayarlandığında uygulanabilir. True olarak ayarlandığında, Ana Bilgisayar'a atanmış bir IP adresi aracılığıyla Kapsayıcı'nın Ana Bilgisayar'a veya Ana Bilgisayar'ın Kapsayıcı'ya bağlanmasına izin verir. 127.0.0.1 geri döngü adresinin her zaman kullanılabileceğini unutmayın. Bu seçenek, ek olarak atanan tüm yerel IP adreslerinin kullanılmasına da olanak verir.
zh_cn: 仅当 wsl2.networkingMode 设置为镜像(mirrored)时适用。设置为 True 时，将允许容器与主机通过分配给主机的 IP 地址互相连接。请注意，始终可以使用 127.0.0.1 环回地址 - 此选项还允许使用所有额外分配的本地 IP 地址。
zh_tw: 僅適用於 wsl2.networkingMode 設為鏡像時。設定為 True 時，將允許容器透過指派給主機的 IP 位址連線到主機，或允許主機連線到容器。請注意，一律可以使用 127.0.0.1 回送位址 - 此選項也允許使用所有額外指派的本機 IP 位址。

# Settings_IgnoredPorts.Header
source: Ignored ports
cs_cz: Ignorované porty
da_dk: Ignorerede porte
de_de: Ignorierte Ports
el_gr: Αγνοημένες θύρες
es_es: Puertos omitidos
fi_fi: Ohitetut portit
fr_fr: Ports ignorés
hu_hu: Figyelmen kívül hagyott portok
it_it: Porte ignorate
ja_jp: 無視されたポート
ko_kr: 무시된 포트
nb_no: Ignorerte porter
nl_nl: Genegeerde poorten
pl_pl: Zignorowane porty
pt_br: Portas ignoradas
pt_pt: Portas ignoradas
ru_ru: Пропущенные порты
sv_se: Ignorerade portar
tr_tr: Yoksayılan bağlantı noktaları
zh_cn: 忽略的端口
zh_tw: 已忽略的連接埠

# Settings_IgnoredPorts.Description
source: Only applicable when wsl2.networkingMode is set to mirrored. Specifies which ports Linux applications can bind to that will not be automatically forwarded or considered in Windows. Should be formatted in a comma separated list, e.g: 3000,9000,9090.
cs_cz: Lze použít pouze v případě, že je vlastnost wsl2.networkingMode nastavena na zrcadlený režim. Určuje porty, na které se můžou linuxové aplikace vázat, a které se nebudou automaticky přesměrovávat ani zvažovat ve Windows. Měl by být formátován v seznamu odděleném čárkami, například: 3000 9000 9090.
da_dk: Gælder kun, når wsl2.networkingMode er indstillet til spejlet. Angiver, hvilke porte Linux-programmer kan binde til, som ikke automatisk videresendes eller tages i betragtning i Windows. Skal formateres i en kommasepareret liste, f.eks.: 3000,9000,9090.
de_de: Gilt nur, wenn wsl2.networkingMode auf "gespiegelt" festgelegt ist. Gibt an, an welche Ports Linux-Anwendungen binden können, die nicht automatisch weitergeleitet oder in Windows berücksichtigt werden. Muss in einer durch Kommas getrennten Liste formatiert werden, z. B.: 3000.9000.9090.
el_gr: Ισχύει μόνο όταν το wsl2.networkingMode έχει οριστεί σε mirrored. Καθορίζει σε ποιες θύρες μπορούν να δεσμευτούν (bind) οι εφαρμογές Linux που δεν θα προωθούνται αυτόματα ούτε θα λαμβάνονται υπόψη στα Windows. Πρέπει να μορφοποιηθεί ως λίστα διαχωρισμένη με κόμματα, π.χ.: 3000,9000,9090.
es_es: Solo es aplicable cuando wsl2.networkingMode se establece en reflejado. Especifica a qué puertos se pueden enlazar las aplicaciones de Linux que no se reenviarán ni considerarán automáticamente en Windows. Debe formatearse en una lista separada por comas, por ejemplo: 3000.9000.9090.
fi_fi: Käytettävissä vain, kun wsl2.networkingMode on asetettu peilatuksi. Määrittää, mihin portteihin Linux-sovellukset voivat sitoa, joita ei lähetetä automaattisesti edelleen tai oteta huomioon Windowsissa. Tulee muotoilla pilkuin eroteltuna luettelona, esimerkiksi 3000,9000,9090.
fr_fr: Applicable uniquement lorsque wsl2.networkingMode est défini sur mise en miroir. Spécifie les ports auxquels les applications Linux peuvent se lier et qui ne seront pas automatiquement transférés ou pris en compte dans Windows. Doit être mis en forme dans une liste séparée par des virgules, par exemple : 3 000,9 000,9 090.
hu_hu: Csak akkor alkalmazható, ha a wsl2.networkingMode mirrored értékre van beállítva. Megadja, hogy mely portokhoz kapcsolódhatnak a Linux-alkalmazások, amelyek nem lesznek automatikusan továbbítva vagy figyelembe véve a Windowsban. Vesszővel tagolt listában kell formázni, például 3000,9000,9090.
it_it: Applicabile solo quando wsl2.networkingMode è impostato su mirroring. Specifica a quali porte possono essere associate applicazioni Linux che non verranno inoltrate o considerate automaticamente in Windows. Deve essere formattato in un elenco delimitato da virgole, ad esempio 3000,9000,9090.
ja_jp: wsl2.networkingMode がミラー化に設定されている場合にのみ適用できます。Windows で自動的に転送または考慮されない Linux アプリケーションがバインドできるポートを指定します。コンマ区切りの一覧で書式設定する必要があります (例: 3000,9000,9090)。
ko_kr: wsl2.networkingMode 미러링으로 설정된 경우에만 적용할 수 있습니다. Linux 애플리케이션이 Windows에서 자동으로 전달되거나 고려되지 않는 바인딩할 수 있는 포트를 지정합니다. 쉼표로 구분된 목록(예: 3000,9000,9090)으로 서식을 지정해야 합니다.
nb_no: Gjelder bare når wsl2.networkingMode er satt til avspeilet. Angir hvilke porter Linux-programmer kan binde til som ikke videresendes eller vurderes automatisk i Windows. Skal formateres i en kommadelt liste, for eksempel 3000,9000,9090.
nl_nl: Alleen van toepassing wanneer wsl2.networkingMode is ingesteld op gespiegeld. Hiermee geeft u op aan welke poorten Linux-toepassingen kunnen binden, die niet automatisch worden doorgestuurd of overwogen in Windows. Moet worden opgemaakt in een door komma's gescheiden lijst, bijvoorbeeld: 3000.9000.9090.
pl_pl: Ma zastosowanie tylko wtedy, gdy właściwość wsl2.networkingMode jest ustawiona na wartość Dublowana. Określa, z którymi portami mogą być powiązane aplikacje systemu Linux, które nie będą automatycznie przesyłane dalej ani uwzględniane w systemie Windows. Powinien być sformatowany na liście rozdzielanej przecinkami, np. 3000,9000,9090.
pt_br: Aplicável somente quando wsl2.networkingMode está definido como espelhado. Especifica as portas às quais os aplicativos Linux podem se associar que não serão encaminhadas ou consideradas automaticamente no Windows. Deve ser formatado em uma lista separada por vírgulas, por exemplo: 3000.9000.9090.
pt_pt: Apenas aplicável quando wsl2.networkingMode está definido como espelhado. Especifica as portas a que as aplicações Linux podem vincular que não serão reencaminhadas ou consideradas automaticamente no Windows. Deve ser formatado numa lista separada por vírgulas, por exemplo: 3000.9000.9090.
ru_ru: Применимо только в том случае, если для wsl2.networkingMode установлено зеркальное отображение. Указывает, к каким портам могут привязываться приложения Linux, которые не будут автоматически пересылаться или учитываться в Windows. Должен быть отформатирован в виде списка, разделенного запятыми, например: 3000,9000,9090.
sv_se: Gäller endast när wsl2.networkingMode är inställt på spegling. Anger vilka portar Som Linux-program kan binda till som inte vidarebefordras automatiskt eller beaktas i Windows. Ska formateras i en kommaavgränsad lista, t.ex. 3000 9000 9090.
tr_tr: Yalnızca wsl2.networkingMode olarak ayarlandığında uygulanabilir. Linux uygulamalarının otomatik olarak iletilen veya Windows'ta değerlendirilen bağlantı noktalarına bağlanacak bağlantı noktalarını belirtir. Virgülle ayrılmış bir listede biçimlendirilmelidir, örneğin: 3000.9000.9090.
zh_cn: 仅当 wsl2.networkingMode 设置为镜像(mirrored)时适用。指定 Linux 应用程序可以绑定的端口，这些端口不会 Windows 自动转发或考虑。应采用逗号分隔的列表格式，例如：3000,9000,9090。
zh_tw: 只有在 wsl2.networkingMode 設為鏡像時才適用。指定 Linux 應用程式可以繫結到哪些埠，而這些埠不會自動轉送，也不會在 Windows 中納入考慮。格式應為逗號分隔清單，例如： 3000,9000,9090。

# Settings_IgnoredPortsResetButton.Content
source: Reset ports
cs_cz: Resetovat porty
da_dk: Nulstil porte
de_de: Ports zurücksetzen
el_gr: Επαναφορά θυρών
es_es: Restablecer puertos
fi_fi: Palauta portit
fr_fr: Réinitialiser les ports
hu_hu: Portok alaphelyzetbe állítása
it_it: Reimposta porte
ja_jp: ポートのリセット
ko_kr: 포트 초기화
nb_no: Tilbakestill porter
nl_nl: Poorten opnieuw instellen
pl_pl: Resetuj porty
pt_br: Redefinir portas
pt_pt: Repor portas
ru_ru: Сброс портов
sv_se: Återställ portar
tr_tr: Bağlantı noktalarını sıfırla
zh_cn: 重置端口
zh_tw: 重設連接埠

# Settings_IgnoredPortsTextBox.AutomationProperties.Name
source: Ignored ports
cs_cz: Ignorované porty
da_dk: Ignorerede porte
de_de: Ignorierte Ports
el_gr: Αγνοημένες θύρες
es_es: Puertos omitidos
fi_fi: Ohitetut portit
fr_fr: Ports ignorés
hu_hu: Figyelmen kívül hagyott portok
it_it: Porte ignorate
ja_jp: 無視されたポート
ko_kr: 무시된 포트
nb_no: Ignorerte porter
nl_nl: Genegeerde poorten
pl_pl: Zignorowane porty
pt_br: Portas ignoradas
pt_pt: Portas ignoradas
ru_ru: Пропущенные порты
sv_se: Ignorerade portar
tr_tr: Yoksayılan bağlantı noktaları
zh_cn: 忽略的端口
zh_tw: 已忽略的連接埠

# Settings_IgnoredPortsTextBox.AutomationProperties.HelpText
source: Only applicable when wsl2.networkingMode is set to mirrored. Specifies which ports Linux applications can bind to that will not be automatically forwarded or considered in Windows. Should be formatted in a comma separated list, for example, 3000, 9000, 9090.
cs_cz: Lze použít pouze v případě, že je vlastnost wsl2.networkingMode nastavena na zrcadlený režim. Určuje porty, na které se můžou linuxové aplikace vázat a které se nebudou automaticky přesměrovávat ani brát v potaz ve Windows. Měl by být formátován v seznamu odděleném čárkami, například: 3000, 9000, 9090.
da_dk: Gælder kun, når wsl2.networkingMode er indstillet til spejlet. Angiver, hvilke porte Linux-programmer kan binde til, som ikke automatisk videresendes eller tages i betragtning i Windows. Skal formateres i en kommasepareret liste, f.eks.: 3000, 9000, 9090.
de_de: Gilt nur, wenn wsl2.networkingMode auf gespiegelt festgelegt ist. Gibt an, an welche Ports Linux-Anwendungen gebunden werden können, die in Windows nicht automatisch weitergeleitet oder berücksichtigt werden. Muss in einer durch Komma getrennten Liste formatiert werden, z. B. 3000, 9000, 9090.
el_gr: Ισχύει μόνο όταν το wsl2.networkingMode έχει οριστεί σε mirrored. Καθορίζει σε ποιες θύρες μπορούν να δεσμευτούν οι εφαρμογές Linux που δεν θα προωθούνται αυτόματα ούτε θα λαμβάνονται υπόψη στα Windows. Πρέπει να μορφοποιηθεί ως λίστα διαχωρισμένη με κόμματα, για παράδειγμα, 3000, 9000, 9090.
es_es: Solo es aplicable cuando wsl2.networkingMode está establecido en reflejado. Especifica a qué puertos se pueden enlazar las aplicaciones de Linux que no se reenviarán ni considerarán automáticamente en Windows. Debe formatearse en una lista separada por comas, por ejemplo, 3000, 9000, 9090.
fi_fi: Käytettävissä vain, kun wsl2.networkingMode on asetettu peilatuksi. Määrittää, mihin portteihin Linux-sovellukset voivat sitoa, joita ei lähetetä automaattisesti edelleen tai oteta huomioon Windowsissa. Tulee muotoilla pilkuin eroteltuna luettelona, esimerkiksi 3000, 9000, 9090.
fr_fr: Applicable uniquement lorsque wsl2.networkingMode est défini sur mise en miroir. Spécifie les ports auxquels les applications Linux peuvent se lier et qui ne seront pas automatiquement transférés ou pris en compte dans Windows. Doit être mis en forme dans une liste séparée par des virgules, par exemple, 3000, 9000, 9090.
hu_hu: Csak akkor alkalmazható, ha a wsl2.networkingMode mirrored értékre van beállítva. Megadja, hogy mely portokhoz kapcsolódhatnak a Linux-alkalmazások, amelyek nem lesznek automatikusan továbbítva vagy figyelembe véve a Windowsban. Vesszővel tagolt listában kell formázni, például 3000, 9000, 9090.
it_it: Applicabile solo quando wsl2.networkingMode è impostato su mirroring. Specifica le porte a cui le applicazioni Linux possono eseguire il binding che non verranno inoltrate o considerate automaticamente in Windows. Deve essere formattato in un elenco delimitato da virgole, ad esempio 3000, 9000, 9090.
ja_jp: wsl2.networkingMode がミラー化に設定されている場合にのみ適用されます。Windows で自動的に転送または考慮されない Linux アプリケーションがバインドできるポートを指定します。3000、9000、9090 などのコンマ区切りの一覧で書式設定する必要があります。
ko_kr: wsl2.networkingMode가 미러로 설정된 경우에만 적용할 수 있습니다. Linux 애플리케이션이 Windows에서 자동으로 전달되거나 고려되지 않는 바인딩할 수 있는 포트를 지정합니다. 쉼표로 구분된 목록에서 형식을 지정해야 합니다(예: 3000, 9000, 9090).
nb_no: Gjelder bare når wsl2.networkingMode er satt til avspeilet. Angir hvilke porter Linux-programmer kan binde til som ikke videresendes eller vurderes automatisk i Windows. Skal formateres i en kommadelt liste, for eksempel 3000, 9000, 9090.
nl_nl: Alleen van toepassing wanneer wsl2.networkingMode is ingesteld op gespiegeld. Hiermee geeft u op aan welke poorten Linux-toepassingen kunnen binden, die niet automatisch worden doorgestuurd of overwogen in Windows. Moet worden opgemaakt in een door komma's gescheiden lijst, bijvoorbeeld: 3000, 9000, 9090.
pl_pl: Ma zastosowanie tylko wtedy, gdy właściwość wsl2.networkingMode jest ustawiona na wartość Dublowana. Określa, z którymi portami mogą być powiązane aplikacje systemu Linux, które nie będą automatycznie przesyłane dalej ani uwzględniane w systemie Windows. Powinien być sformatowany na liście rozdzielanej przecinkami, na przykład 3000, 9000, 9090.
pt_br: Aplicável somente quando wsl2.networkingMode está definido como espelhado. Especifica as portas às quais os aplicativos Linux podem se associar que não serão encaminhadas ou consideradas automaticamente no Windows. Deve ser formatado em uma lista separada por vírgulas, por exemplo, 3000, 9000, 9090.
pt_pt: Apenas aplicável quando wsl2.networkingMode está definido como espelhado. Especifica as portas a que as aplicações Linux podem vincular que não serão reencaminhadas ou consideradas automaticamente no Windows. Deve ser formatado numa lista separada por vírgulas, por exemplo, 3000, 9000, 9090.
ru_ru: Применимо только в том случае, если для wsl2.networkingMode установлено зеркальное отображение. Указывает, к каким портам могут привязываться приложения Linux, которые не будут автоматически пересылаться или учитываться в Windows. Должен быть отформатирован в виде списка, разделенного запятыми, например, 3000, 9000, 9090.
sv_se: Gäller endast när wsl2.networkingMode är inställt på spegling. Anger vilka portar som Linux-program kan binda till som inte vidarebefordras automatiskt eller tas i beaktande i Windows. Ska formateras i en kommaavgränsad lista, t.ex. 3000, 9000, 9090.
tr_tr: Yalnızca wsl2.networkingMode yansıtılmış olarak ayarlandığında uygulanabilir. Linux uygulamalarının otomatik olarak iletilen veya Windows'ta değerlendirilen bağlantı noktalarına bağlanacak bağlantı noktalarını belirtir. Virgülle ayrılmış bir listede biçimlendirilmelidir, örneğin, 3000, 9000, 9090.
zh_cn: 仅当 wsl2.networkingMode 设置为镜像(mirrored)时适用。指定 Linux 应用程序可以绑定的端口，这些端口不会在 Windows 中自动转发或考虑。应采用逗号分隔的列表格式，例如 3000,9000,9090。
zh_tw: 僅適用於 wsl2.networkingMode 設為鏡像時。指定 Linux 應用程式可以繫結到哪些埠，而這些埠不會自動轉送，也不會在 Windows 中納入考慮。應以逗號分隔清單格式化，例如 3000、9000、9090。

# Settings_InitialAutoProxyTimeout.Header
source: Initial Auto Proxy timeout
cs_cz: Časový limit počátečního automatického proxy serveru
da_dk: Indledende timeout for automatisk proxy
de_de: Timeout für den anfänglichen automatischen Proxy
el_gr: Αρχικό χρονικό όριο (timeout) του Auto Proxy
es_es: Tiempo de espera inicial del proxy automático
fi_fi: Alkuperäinen automaattisen välityspalvelimen aikakatkaisu
fr_fr: Délai d’expiration initial du proxy automatique
hu_hu: Kezdeti automatikus proxy időtúllépése
it_it: Timeout proxy automatico iniziale
ja_jp: 初期のオートプロキシ タイムアウト
ko_kr: 초기 자동 프록시 시간 제한
nb_no: Første tidsavbrudd for automatisk proxy
nl_nl: Time-out voor eerste automatische proxy
pl_pl: Limit czasu początkowego automatycznego serwera proxy
pt_br: Tempo limite inicial do Proxy Automático
pt_pt: Tempo limite inicial do Proxy Automático
ru_ru: Начальное время ожидания автоматического прокси-сервера
sv_se: Tidsgräns för inledande automatisk proxy
tr_tr: İlk Otomatik Ara Sunucu zaman aşımı
zh_cn: 初始自动代理超时
zh_tw: 初始自動 Proxy 逾時
